Sub-IoT/Sub-IoT-Stack/stack/framework/hal/chips/cc430/driverlib/MSP430F5xx_6xx/timer_a.h
//*****************************************************************************
//
//! \brief Clears the capture-compare interrupt flag
//!
//! \param baseAddress is the base address of the TIMER_A module.
//! \param captureCompareRegister selects the Capture-compare register being
//!        used.
//!        Valid values are:
//!        - \b TIMER_A_CAPTURECOMPARE_REGISTER_0
//!        - \b TIMER_A_CAPTURECOMPARE_REGISTER_1
//!        - \b TIMER_A_CAPTURECOMPARE_REGISTER_2
//!        - \b TIMER_A_CAPTURECOMPARE_REGISTER_3
//!        - \b TIMER_A_CAPTURECOMPARE_REGISTER_4
//!        - \b TIMER_A_CAPTURECOMPARE_REGISTER_5
//!        - \b TIMER_A_CAPTURECOMPARE_REGISTER_6
//!
//! Modified bits are \b CCIFG of \b TAxCCTLn register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_A_clearCaptureCompareInterruptFlag(uint16_t baseAddress,
                                                     uint16_t captureCompareRegister);

//*****************************************************************************
//
//! \brief Reads the current timer count value
//!
//! Reads the current count value of the timer. There is a majority vote system
//! in place to confirm an accurate value is returned. The TIMER_A_THRESHOLD
//! #define in the corresponding header file can be modified so that the votes
//! must be closer together for a consensus to occur.
//!
//! \param baseAddress is the base address of the TIMER_A module.
//!
//! \return Majority vote of timer count value
//
//*****************************************************************************
extern uint16_t Timer_A_getCounterValue(uint16_t baseAddress);

//*****************************************************************************
//
// The Timer_A_configureContinuousMode() API has been deprecated. Instead
// please use the Timer_A_initContinuousMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_A_configureContinuousMode(uint16_t baseAddress,
                                            uint16_t clockSource,
                                            uint16_t clockSourceDivider,
                                            uint16_t timerInterruptEnable_TAIE,
                                            uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_A_configureUpMode() API has been deprecated. Instead please use
// the Timer_A_initUpMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_A_configureUpMode(uint16_t baseAddress,
                                    uint16_t clockSource,
                                    uint16_t clockSourceDivider,
                                    uint16_t timerPeriod,
                                    uint16_t timerInterruptEnable_TAIE,
                                    uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                    uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_A_configureUpDownMode() API has been deprecated. Instead please
// use the Timer_A_initUpDownMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_A_configureUpDownMode(uint16_t baseAddress,
                                        uint16_t clockSource,
                                        uint16_t clockSourceDivider,
                                        uint16_t timerPeriod,
                                        uint16_t timerInterruptEnable_TAIE,
                                        uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                        uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_A_startContinuousMode() API has been deprecated. Instead please
// use the Timer_A_startCounter() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_A_startContinuousMode(uint16_t baseAddress,
                                        uint16_t clockSource,
                                        uint16_t clockSourceDivider,
                                        uint16_t timerInterruptEnable_TAIE,
                                        uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_A_startContinousMode() API has been deprecated. Instead please use
// the Timer_A_startCounter() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_A_startContinousMode(uint16_t baseAddress,
                                       uint16_t clockSource,
                                       uint16_t clockSourceDivider,
                                       uint16_t timerInterruptEnable_TAIE,
                                       uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_A_startUpMode() API has been deprecated. Instead please use the
// Timer_A_startCounter() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_A_startUpMode(uint16_t baseAddress,
                                uint16_t clockSource,
                                uint16_t clockSourceDivider,
                                uint16_t timerPeriod,
                                uint16_t timerInterruptEnable_TAIE,
                                uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_A_startUpDownMode() API has been deprecated. Instead please use
// the Timer_A_startCounter() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_A_startUpDownMode(uint16_t baseAddress,
                                    uint16_t clockSource,
                                    uint16_t clockSourceDivider,
                                    uint16_t timerPeriod,
                                    uint16_t timerInterruptEnable_TAIE,
                                    uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                    uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_A_initCapture() API has been deprecated. Instead please use the
// Timer_A_initCaptureMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_A_initCapture(uint16_t baseAddress,
                                uint16_t captureRegister,
                                uint16_t captureMode,
                                uint16_t captureInputSelect,
                                uint16_t synchronizeCaptureSource,
                                uint16_t captureInterruptEnable,
                                uint16_t captureOutputMode);
#endif

//*****************************************************************************
//
// The Timer_A_initCompare() API has been deprecated. Instead please use the
// Timer_A_initCompareMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_A_initCompare(uint16_t baseAddress,
                                uint16_t compareRegister,
                                uint16_t compareInterruptEnable,
                                uint16_t compareOutputMode,
                                uint16_t compareValue);
#endif

//*****************************************************************************
//
// The Timer_A_generatePWM() API has been deprecated. Instead please use the
// Timer_A_outputPWM() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_A_generatePWM(uint16_t baseAddress,
                                uint16_t clockSource,
                                uint16_t clockSourceDivider,
                                uint16_t timerPeriod,
                                uint16_t compareRegister,
                                uint16_t compareOutputMode,
                                uint16_t dutyCycle);
#endif

//*****************************************************************************
//
// The following are deprecated API names. These were updated to new names to
// add compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#define TIMER_A_startCounter                               Timer_A_startCounter
#define TIMER_A_initContinuousMode                   Timer_A_initContinuousMode
#define TIMER_A_configureContinuousMode         Timer_A_configureContinuousMode
#define TIMER_A_initUpMode                                   Timer_A_initUpMode
#define TIMER_A_configureUpMode                         Timer_A_configureUpMode
#define TIMER_A_initUpDownMode                           Timer_A_initUpDownMode
#define TIMER_A_configureUpDownMode                 Timer_A_configureUpDownMode
#define TIMER_A_startContinuousMode                 Timer_A_startContinuousMode
#define TIMER_A_startContinousMode                   Timer_A_startContinousMode
#define TIMER_A_startUpMode                                 Timer_A_startUpMode
#define TIMER_A_startUpDownMode                         Timer_A_startUpDownMode
#define TIMER_A_initCaptureMode                         Timer_A_initCaptureMode
#define TIMER_A_initCapture                                 Timer_A_initCapture
#define TIMER_A_initCompareMode                         Timer_A_initCompareMode
#define TIMER_A_initCompare                                 Timer_A_initCompare
#define TIMER_A_enableInterrupt                         Timer_A_enableInterrupt
#define TIMER_A_disableInterrupt                       Timer_A_disableInterrupt
#define TIMER_A_getInterruptStatus                   Timer_A_getInterruptStatus
#define TIMER_A_enableCaptureCompareInterrupt                                 \
    Timer_A_enableCaptureCompareInterrupt
#define TIMER_A_disableCaptureCompareInterrupt                                \
    Timer_A_disableCaptureCompareInterrupt
#define TIMER_A_getCaptureCompareInterruptStatus                              \
    Timer_A_getCaptureCompareInterruptStatus
#define TIMER_A_clear                                             Timer_A_clear
#define TIMER_A_getSynchronizedCaptureCompareInput                            \
    Timer_A_getSynchronizedCaptureCompareInput
#define TIMER_A_getOutputForOutputModeOutBitValue                             \
    Timer_A_getOutputForOutputModeOutBitValue
#define TIMER_A_getCaptureCompareCount           Timer_A_getCaptureCompareCount
#define TIMER_A_setOutputForOutputModeOutBitValue                             \
    Timer_A_setOutputForOutputModeOutBitValue
#define TIMER_A_outputPWM                                     Timer_A_outputPWM
#define TIMER_A_generatePWM                                 Timer_A_generatePWM
#define TIMER_A_stop                                               Timer_A_stop
#define TIMER_A_setCompareValue                         Timer_A_setCompareValue
#define TIMER_A_clearTimerInterruptFlag         Timer_A_clearTimerInterruptFlag
#define TIMER_A_clearCaptureCompareInterruptFlag                              \
    Timer_A_clearCaptureCompareInterruptFlag
#define TIMER_A_getCounterValue                         Timer_A_getCounterValue
#endif

//*****************************************************************************
//
// The following are deprecated struct names. These were updated to new names
// to add compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#define TIMER_A_initContinuousModeParam         Timer_A_initContinuousModeParam
#define TIMER_A_initCaptureModeParam               Timer_A_initCaptureModeParam
#define TIMER_A_initUpDownModeParam                 Timer_A_initUpDownModeParam
#define TIMER_A_outputPWMParam                           Timer_A_outputPWMParam
#define TIMER_A_initUpModeParam                         Timer_A_initUpModeParam
#define TIMER_A_initCompareModeParam               Timer_A_initCompareModeParam
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif
#endif // __MSP430WARE_TIMER_A_H__
